{
  "02139": {
    "bottle": "Place in curbside recycling (rinse and remove caps).",
    "cup": "If compostable, put in compost; otherwise place in landfill/regular waste.",
    "wine glass": "Glass recycling rules vary; check local drop-off — usually not curbside.",
    "vase": "Glass/vase items may require special drop-off.",
    "default": "Check your municipality's recycling guidance for specifics."
  },
  "94105": {
    "bottle": "Curbside recycling — ensure containers are empty and dry.",
    "cup": "Plastic cups may not be accepted; remove lids and check local rules.",
    "vase": "Treat as glass — some programs require special drop-off.",
    "default": "When in doubt, consult local recycling authority or website."
  },
  "10001": {
    "bottle": "Empty and rinse; place in single-stream curbside recycling.",
    "cup": "Disposable paper cups typically not accepted; check local guidelines.",
    "wine glass": "Not accepted curbside; look for glass drop-off options.",
    "default": "Visit local sanitation website for full list of accepted materials."
  },
  "60601": {
    "bottle": "Accepted in curbside recycling if rinsed.",
    "cup": "Polystyrene/foam cups are not accepted; paper cups vary.",
    "vase": "Large glass pieces may need to be dropped off",
    "default": "Separate cardboard and paper; flatten boxes for pickup."
  },
  "30301": {
    "bottle": "Place in recycling bin after emptying.",
    "cup": "Check for compostable markings; otherwise landfill.",
    "vase": "Glass may require special handling; consult local rules.",
    "default": "Many curbside programs accept mixed containers; confirm locally.",
    "company": "Waste Management (City of Atlanta)"
  },
  "98101": {
    "bottle": "Glass bottles accepted in curbside recycling; rinse and place loose in bin.",
    "cup": "Compostable/paper cups go in compost cart; plastic cups in trash.",
    "wine glass": "Broken glass should be wrapped; place in regular trash, not recycling.",
    "vase": "Glass items accepted; ensure no sharp edges exposed.",
    "default": "Seattle has separate compost, recycling, and trash carts.",
    "company": "Waste Management & City of Seattle Environmental Services"
  },
  "90001": {
    "bottle": "Plastic and glass bottles accepted; crush cans and bottles for space.",
    "cup": "Disposable cups typically go to trash unless compostable certified.",
    "wine glass": "Not recommended for curbside; use local glass drop-off.",
    "vase": "Glass items may be accepted; call local waste provider to confirm.",
    "default": "Los Angeles curbside accepts mixed recyclables.",
    "company": "City of Los Angeles Sanitation Services"
  },
  "80202": {
    "bottle": "Curbside recycling accepts plastic, glass, and aluminum bottles.",
    "cup": "Paper and plastic cups not accepted; compost if available.",
    "wine glass": "Glass items welcome if placed carefully in bin.",
    "vase": "Acceptable; large glass pieces should be bundled safely.",
    "default": "Denver accepts single-stream recycling with curbside pickup.",
    "company": "Denver Solid Waste Management"
  },
  "33101": {
    "bottle": "Plastic and glass bottles accepted; rinse thoroughly in hot climate.",
    "cup": "Foam/polystyrene cups not accepted; paper cups to trash.",
    "wine glass": "Check with local waste provider; some accept glass.",
    "vase": "Glass items generally accepted; confirm locally first.",
    "default": "Miami-Dade County provides curbside recycling bins.",
    "company": "Miami-Dade Waste Management"
  },
  "97201": {
    "bottle": "All beverage bottles accepted in Portland's commingled recycling.",
    "cup": "Compostable cups go in food scrap bin; others to trash.",
    "wine glass": "Regular glass in trash; beverage bottles in recycling only.",
    "vase": "Glass items acceptable; wrap sharp edges for safety.",
    "default": "Portland emphasizes composting and source reduction.",
    "company": "City of Portland & Waste Management"
  }
}
